leetcode_2441_largest_positive_integer_that_exists_with_its_negative.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2441. Largest Positive Integer That Exists With Its Negative</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2441. Largest Positive Integer That Exists With Its Negative</h1>

<div id="outline-container-org2ebd3d0" class="outline-2">
<h2 id="org2ebd3d0">Understand the problem</h2>
<div class="outline-text-2" id="text-org2ebd3d0">
<p>
Given an array \(a\), find the largest integer \(k\) such that \(-k\) is also in \(a\).
</p>
</div>

<div id="outline-container-org490e7ff" class="outline-3">
<h3 id="org490e7ff">Useful prompts</h3>
<div class="outline-text-3" id="text-org490e7ff">
<ul class="org-ul">
<li><a href="can_we_use_brute_force_to_solve_the_problem.html#ID-29512D97-A54D-42F9-A8C7-C3422881933B">Can we use brute-force to solve the problem?</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org12e11d6" class="outline-2">
<h2 id="org12e11d6">Devise a plan</h2>
<div class="outline-text-2" id="text-org12e11d6">
<p>
Use a <code>set</code> to store numbers of \(a\) and for each one \(x\) from the largest to the smaller, check if \(-x\) is also in the set.
</p>
</div>

<div id="outline-container-orgc8b1783" class="outline-3">
<h3 id="orgc8b1783">Carry out the plan</h3>
<div class="outline-text-3" id="text-orgc8b1783">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">findMaxK</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        seen = <span style="font-weight: bold;">set</span>(nums)
        <span style="font-weight: bold;">for</span> n <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">sorted</span>(nums, reverse=<span style="font-weight: bold; text-decoration: underline;">True</span>):
            <span style="font-weight: bold;">if</span> -n <span style="font-weight: bold;">in</span> seen:
                <span style="font-weight: bold;">return</span> n
        <span style="font-weight: bold;">return</span> -1
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>